app/controllers/emails_controller.rb

	def create
		@email = Email.new(email_params)

		respond_to do |format|
			if @email.save
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["object", "tfuvlbh"], ["body", "78451"], ["created_at", "2017-11-29 18:50:58.413157"], ["updated_at", "2017-11-29 18:50:58.413157"]]

	def destroy
		@email.destroy
---
DELETE FROM "emails" WHERE "emails"."id" = ?  [["id", 1]]

	def set_email
		@email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]